In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\14008\appdata\local\programs\python\python311\lib\site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\14008\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\14008\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\14008\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\14008\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.25.1)
Requirement already satisfied: six>=1.5 in c:\users\14008\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
from datetime import datetime

In [3]:
Order_Det=pd.read_csv("C:/Users/14008/Desktop/Project s/Order_Details.csv")
Customer=pd.read_csv("C:/Users/14008/Desktop/Project s/Customer.csv")
Product=pd.read_csv("C:/Users/14008/Desktop/Project s/Product.csv")
USstate=pd.read_excel("c:/Users/14008/Desktop/Project s/uscities.xlsx")

In [4]:
Order_Det.describe()

           OrderID   CustomerID    ProductID     Quantity
count  5000.000000  5000.000000  4984.000000  4965.000000
mean   2500.495800    10.541400    47.124599     2.014099
std    1443.521956     5.719478    27.352111     0.825536
min       1.000000     1.000000     1.000000    -3.000000
25%    1250.750000     6.000000    23.000000     1.000000
50%    2500.500000    11.000000    47.000000     2.000000
75%    3750.250000    15.000000    70.000000     3.000000
max    5000.000000    20.000000    94.000000     3.000000

In [5]:
Customer.describe()

       CustomerID
count   30.000000
mean    15.433333
std      8.775685
min      1.000000
25%      8.250000
50%     15.500000
75%     22.750000
max     30.000000

In [6]:
Product.describe()

       ProductID  ListedPrice  DiscountedPrice
count  94.000000    94.000000        94.000000
mean   47.117021    49.015957        96.146809
std    27.419425   127.609798       266.228204
min     1.000000  -900.000000      -400.000000
25%    23.250000    14.000000        11.400000
50%    46.500000    30.000000        28.000000
75%    70.750000    78.750000        68.000000
max    94.000000   500.000000      2020.000000

D_01: OrderID:


A- check the type.


B- Check if any value is null.


C- Check if it unique.

In [7]:
Order_Det['OrderID'].describe()

count    5000.000000
mean     2500.495800
std      1443.521956
min         1.000000
25%      1250.750000
50%      2500.500000
75%      3750.250000
max      5000.000000
Name: OrderID, dtype: float64

In [8]:
Order_Det['OrderID'].isnull().sum()

0

In [9]:
Order_Det['OrderID'].duplicated().sum()

14

==========================

D_02:OrderDate

1- Must be date

In [10]:
Order_Det['OrderDate'].describe()

count          4960
unique          973
top       8/26/2015
freq             15
Name: OrderDate, dtype: object

In [11]:
Order_Det['OrderDate'].isnull().sum()

40

========================

D_03:CustomerID

A- check the type.


B- Check if any value is null in PK.

C- Check if any value is null in FK.


C- Check if it unique.

In [12]:
Customer['CustomerID'].describe()

count    30.000000
mean     15.433333
std       8.775685
min       1.000000
25%       8.250000
50%      15.500000
75%      22.750000
max      30.000000
Name: CustomerID, dtype: float64

In [13]:
Customer['CustomerID'].isnull().sum()

0

In [14]:
Order_Det['CustomerID'].isnull().sum()

0

In [15]:
Customer['CustomerID'].duplicated().sum()

2

=====================================

D_04: ProductID


A- check the type.


B- Check if any value is null in PK.

C- Check if any value is null in FK.


C- Check if it unique.

In [16]:
Product['ProductID'].describe()

count    94.000000
mean     47.117021
std      27.419425
min       1.000000
25%      23.250000
50%      46.500000
75%      70.750000
max      94.000000
Name: ProductID, dtype: float64

In [17]:

Product['ProductID'].isnull().sum()

0

In [18]:
Order_Det['ProductID'].isnull().sum()

16

In [19]:
Product['ProductID'].duplicated().sum()

4

=================================

D_05: Quantity


A- check the type.


B- Check if any value is null in FK.

In [20]:
Order_Det['Quantity'].describe()

count    4965.000000
mean        2.014099
std         0.825536
min        -3.000000
25%         1.000000
50%         2.000000
75%         3.000000
max         3.000000
Name: Quantity, dtype: float64

In [21]:
Order_Det['Quantity'].isnull().sum()

35

======================================

D_06: ProductName:

A- check the type.


B- Check if any value is null.


C- Check if it unique.

In [22]:
Product['ProductName'].describe()

count              94
unique             94
top       Large Towel
freq                1
Name: ProductName, dtype: object

In [23]:
Product['ProductName'].isnull().sum()

0

In [24]:
Product['ProductName'].duplicated().sum()

0

=============================

D_06: ProductCategory:

A- check the type.


B- Check if any value is null.


C- Check if it unique.

In [25]:
Product['ProductCategory'].describe()

count              86
unique              6
top       Furnishings
freq               24
Name: ProductCategory, dtype: object

In [26]:

Product['ProductCategory'].isnull().sum()

8

In [27]:
Product['ProductCategory'].duplicated().sum()

87

==================================


D_08: ListedPrice


A- check the type.


B- Check if any value is null.

In [28]:
Product['ListedPrice'].describe()

count     94.000000
mean      49.015957
std      127.609798
min     -900.000000
25%       14.000000
50%       30.000000
75%       78.750000
max      500.000000
Name: ListedPrice, dtype: float64

In [29]:
Product['ListedPrice'].isnull().sum()

0

=================================

D_09: DiscountedPrice


A- check the type.


B- Check if any value is null.

In [30]:
Product['DiscountedPrice'].describe()

count      94.000000
mean       96.146809
std       266.228204
min      -400.000000
25%        11.400000
50%        28.000000
75%        68.000000
max      2020.000000
Name: DiscountedPrice, dtype: float64

In [31]:
Product['DiscountedPrice'].isnull().sum()

0

================================

D_10:CustomerBirthDate

A- check the type.


B- Check if any value is null .

In [32]:
Customer['CustomerBirthDate'].describe()

count            26
unique           26
top       2/11/2006
freq              1
Name: CustomerBirthDate, dtype: object

In [33]:
Customer['CustomerBirthDate'].isnull().sum()

4

=================================================

D_11: CustomerCity

A- check the type.


B- Check if any value is null

In [34]:
Customer['CustomerCity'].describe()

count           30
unique          20
top       New York
freq             4
Name: CustomerCity, dtype: object

In [35]:
Customer['CustomerCity'].isnull().sum()

0

=========================================

D_12: CustomerState

A- check the type.


B- Check if any value is null.

In [36]:
Customer['CustomerState'].describe()

count             30
unique            18
top       Washington
freq               5
Name: CustomerState, dtype: object

In [37]:
Customer['CustomerState'].isnull().sum()

0

=======================================

R_05: ListedPrice of the same product category should fall within Â± 2 standard deviations

In [38]:
print(Product.columns)

Index(['ProductID', 'ProductName', 'ProductCategory', 'ListedPrice',
       'DiscountedPrice'],
      dtype='object')

In [39]:
Product_group = Product.groupby('ProductCategory')['ListedPrice'].apply(list)

Prodcuct_Category = pd.DataFrame(Product_group)

print(Prodcuct_Category)

                                                       ListedPrice
ProductCategory
Furnishings      [10.0, 5.0, 25.0, 115.0, 300.0, 250.0, 45.0, 1...
Furnitures                                                  [85.0]
Housekeeping     [9.0, 5.0, 3.0, 40.0, 40.0, 40.0, 35.0, 35.0, ...
Maintenance      [14.0, 8.0, 202.0, 27.0, 27.0, 89.0, 21.0, 30....
Office Supplies  [30.0, 50.0, -3.0, 85.0, 24.0, 28.0, 13.0, 8.0...
Public Areas     [35.0, 80.0, 20.0, 103.0, 27.0, 3.0, 60.0, 75....

In [40]:
average_p = {}
for category in Prodcuct_Category.index:
    average_p2 = sum(Prodcuct_Category.loc[category, 'ListedPrice']) / len(Prodcuct_Category.loc[category, 'ListedPrice'])
    average_p[category] = average_p2
for category, average_p2 in average_p.items():
    print(category,average_p2)

Furnishings 52.583333333333336
Furnitures 85.0
Housekeeping 50.611111111111114
Maintenance 46.38461538461539
Office Supplies 21.307692307692307
Public Areas 60.38235294117647

In [41]:
df = pd.DataFrame(Product)
std_by_category = df.groupby('ProductCategory')['ListedPrice'].mean()
std_by_category

ProductCategory
Furnishings        52.583333
Furnitures         85.000000
Housekeeping       50.611111
Maintenance        46.384615
Office Supplies    21.307692
Public Areas       60.382353
Name: ListedPrice, dtype: float64

R_08: CustomerBirthDate should not be less than 18 years or more than 120 years from now

1-Check the format of the date.


2-Create a function to count the dates.


3-Set the condition.

In [42]:
def calculate_age(birthdate):
    today_D = datetime.today()
    birthdate = datetime.strptime(birthdate, '%m/%d/%Y') 
    age = today_D.year - birthdate.year - ((today_D.month, today_D.day) < (birthdate.month, birthdate.day))
    return age

In [43]:
count_minors = sum(1 for birthdate in Customer['CustomerBirthDate'] if isinstance(birthdate, str) and calculate_age(birthdate) < 18)
count_minors2 = sum(1 for birthdate in Customer['CustomerBirthDate'] if isinstance(birthdate, str) and calculate_age(birthdate) >120)

print("Number of customers less than 18 years old:",count_minors)
print("Number of customers more than 120 years old:",count_minors2)

Number of customers less than 18 years old: 1
Number of customers more than 120 years old: 1

R_09: OrderDate cannot be a date in the future

1-Check the format of the date.


2-Set the condition.

In [44]:
#We must make a loop to confert all the values to dates.
#due to some of the values is null, so we must add if statment

valid_order_dates = [date_str for date_str in Order_Det['OrderDate'] if isinstance(date_str, str)]
Order_Date2 = [datetime.strptime(date_str, '%m/%d/%Y') for date_str in valid_order_dates]

In [45]:

current_date = datetime.today()
future_dates_count = sum(
    1 for date in Order_Date2
    if date > current_date)

print("Number of future dates:", future_dates_count)

Number of future dates: 40

R_10: DiscountedPrice cannot be a negative value

1-Check the discount prices.

3-Set the condition.

In [46]:
Product.columns

Index(['ProductID', 'ProductName', 'ProductCategory', 'ListedPrice',
       'DiscountedPrice'],
      dtype='object')

In [47]:
Product['DiscountedPrice'].describe()

count      94.000000
mean       96.146809
std       266.228204
min      -400.000000
25%        11.400000
50%        28.000000
75%        68.000000
max      2020.000000
Name: DiscountedPrice, dtype: float64

In [48]:
Dis_p = Product['DiscountedPrice']
Dis_Pri = sum(
    1 for D_p in Dis_p
    if D_p< 0)
print(Dis_Pri)

6

R_11: ListedPrice cannot be a negative value


1-Check the Listed prices.

3-Set the condition.

In [49]:
List_p = Product['ListedPrice']
List_Pri = sum(
    1 for D_p in List_p
    if D_p< 0)
print(List_Pri)

6

R_12: Quantity cannot be a negative value

1-Check the Quantity.

3-Set the condition.

In [50]:
Order_Det.columns

Index(['OrderID', 'OrderDate', 'CustomerID', 'ProductID', 'Quantity'], dtype='object')

In [51]:
Quantity = Order_Det['Quantity']
Quan = sum(
    1 for D_p in Quantity
    if D_p< 0)
print(Quan)

7

R_13: CustomerCity should be populated based on a pre-specfied list of strings ['Atlanta', 'Boston', 'Chicago', 'Dallas', 'Denver', 'Las Vegas', 'Los Angeles', 'Nashville', 'New York', 'Orlando', 'Philadelphia', 'Phoenix', 'Portland', 'Richmond', 'San Francisco', 'Seattle']

1-Check the customer city .

3-Set the condition.

In [52]:
cities = ['Atlanta', 'Boston', 'Chicago', 'Dallas', 'Denver', 'Las Vegas', 'Los Angeles', 'Nashville', 'New York', 'Orlando', 'Philadelphia', 'Phoenix', 'Portland', 'Richmond', 'San Francisco', 'Seattle']

CustC = Customer['CustomerCity']
Notin_C = sum(1 for city in CustC if city not in cities)

print( Notin_C)

5

R_14: CustomerState should be populated based on a pre-specfied list of strings ['Arizona', 'California', 'Colorado', 'Florida', 'Georgia', 'Illinois', 'Massachusetts', 'Nevada', 'New York', 'Oregon', 'Pennsylvania', 'Tennessee', 'Texas', 'Virginia', 'Washington']

1-Check the Customer State .

3-Set the condition.

In [53]:
State = ['Arizona', 'California', 'Colorado', 'Florida', 'Georgia', 'Illinois', 'Massachusetts', 'Nevada', 'New York', 'Oregon', 'Pennsylvania', 'Tennessee', 'Texas', 'Virginia', 'Washington']

CustS = Customer['CustomerState']
Notin_S = sum(1 for city in CustS if city not in State)

print( Notin_S)

6

R_15: ProductCategory should be populated based on a pre-specfied list of strings ['Housekeeping', 'Office Supplies', 'Furnishings', 'Maintenance', 'Public Areas']


1-Check the Product Category .

3-Set the condition.

In [70]:
P_Cate = ['Housekeeping', 'Office Supplies', 'Furnishings', 'Maintenance', 'Public Areas']
Pro_C = Product['ProductCategory']
Notin_PC = [Pc for Pc in Pro_C if Pc not in P_Cate]

print( Notin_PC)

[nan, 'Furnitures', nan, nan, nan, nan, nan, nan, nan]

R16: DiscountedPrice cannot be higher than ListedPrice for one specific product

In [55]:
Product.columns

Index(['ProductID', 'ProductName', 'ProductCategory', 'ListedPrice',
       'DiscountedPrice'],
      dtype='object')

In [56]:
In_c= sum(1 for index, row in Product.iterrows()
           if row['DiscountedPrice'] > row['ListedPrice'])

print(In_c)

16

R_17: CustomerCity should be consistent with CustomerState for one specfic customer

In [57]:
Customer

    CustomerID CustomerBirthDate   CustomerCity  CustomerState
0            1         2/11/2006       New York     Washington
1            2               NaN     Cincinnati           Ohio
2            3        11/11/1990       Portland         Oregon
3            4         9/11/1993        Seattle     Washington
4            5          4/3/1989    Kansas City       Missouri
5            6         2/15/1960        Orlando        Florida
6            7               NaN         Boston  Massachusetts
7            8          6/9/1986   Philadelphia   Pennsylvania
8            9         6/15/1953       Richmond       Virginia
9           10          7/2/1998      Arlington      Minnesota
10          11         9/12/1976        Atlanta        Georgia
11          12         2/22/2003         Dallas          Texas
12          12         6/18/1950    New Orleans      Louisiana
13          14        10/13/1946      Nashville      Tennessee
14          15         8/18/1951        Chicago       Illinois
15          16         3/31/1961         Denver       Colorado
16          17               NaN      Las Vegas     New Jersey
17          18        10/20/1985        Phoenix        Arizona
18          19          3/9/1981    Los Angeles     California
19          20         9/13/1947  San Francisco     California
20          21         2/25/1989       New York     Washington
21          22         9/14/1900     Cincinnati      Minnesota
22          23         6/21/1960       Portland         Oregon
23          24        11/16/1972       New York     Washington
24          25         8/29/1954       New York     Washington
25          25          8/9/1956        Atlanta        Georgia
26          27         3/23/1946        Phoenix        Arizona
27          28        10/16/1976    Los Angeles     California
28          29        10/31/1977        Atlanta        Georgia
29          30               NaN        Phoenix        Arizona

In [58]:
Customer.columns

Index(['CustomerID', 'CustomerBirthDate', 'CustomerCity', 'CustomerState'], dtype='object')

In [59]:
Customer[['CustomerID','CustomerCity','CustomerState']]

    CustomerID   CustomerCity  CustomerState
0            1       New York     Washington
1            2     Cincinnati           Ohio
2            3       Portland         Oregon
3            4        Seattle     Washington
4            5    Kansas City       Missouri
5            6        Orlando        Florida
6            7         Boston  Massachusetts
7            8   Philadelphia   Pennsylvania
8            9       Richmond       Virginia
9           10      Arlington      Minnesota
10          11        Atlanta        Georgia
11          12         Dallas          Texas
12          12    New Orleans      Louisiana
13          14      Nashville      Tennessee
14          15        Chicago       Illinois
15          16         Denver       Colorado
16          17      Las Vegas     New Jersey
17          18        Phoenix        Arizona
18          19    Los Angeles     California
19          20  San Francisco     California
20          21       New York     Washington
21          22     Cincinnati      Minnesota
22          23       Portland         Oregon
23          24       New York     Washington
24          25       New York     Washington
25          25        Atlanta        Georgia
26          27        Phoenix        Arizona
27          28    Los Angeles     California
28          29        Atlanta        Georgia
29          30        Phoenix        Arizona

In [60]:
USstate.columns

Index(['city', 'city_ascii', 'state_id', 'state_name', 'county_fips',
       'county_name', 'lat', 'lng', 'population', 'density', 'source',
       'military', 'incorporated', 'timezone', 'ranking', 'zips', 'id'],
      dtype='object')

In [61]:
USS=USstate[['state_name','county_name']]
USS

         state_name  county_name
0          New York       Queens
1        California  Los Angeles
2          Illinois         Cook
3           Florida   Miami-Dade
4             Texas       Dallas
...             ...          ...
30839  Pennsylvania        Blair
30840    New Mexico    Guadalupe
30841         Texas        Starr
30842          Ohio       Morrow
30843    California       Tulare

[30844 rows x 2 columns]

In [62]:
consistent_count = 0

# Assuming you have DataFrames 'Customer' and 'USS' with appropriate columns

for _, customer_row in Customer.iterrows():
    customer_id = customer_row['CustomerID']
    customer_city = customer_row['CustomerCity']
    customer_state = customer_row['CustomerState']
    
    matching_states = USS[USS['county_name'] == customer_city]['state_name'].tolist()
    
    if customer_state in matching_states:
        # print(customer_state,matching_states)
        consistent_count += 1

print("Number of consistent city/state pairs:", consistent_count)

Number of consistent city/state pairs: 7